Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: It can be further customized with the `quarkus.oidc-client.grant-options.password` configuration prefix, similar to the client credentials grant.
ja_jp: クライアントクレデンシャルグラントと同様に、 `quarkus.oidc-client.grant-options.password` 設定接頭辞を使用してさらにカスタマイズできます。

source: It can be injected as a regular emitter `@Channel`:
ja_jp: 通常のエミッター `@Channel` として注入できます。

source: It can be reasonably easy to avoid these situations in your code, but verifying every dependency you use is hard. Typically, while experimenting with virtual threads, we realized that versions older than 42.6.0 of the link:{pgsql-driver}[postgresql-JDBC driver] result in frequent pinning on Java 21-23. On Java 24+, most JDBC drivers no longer pin the carrier thread due to the synchronized improvements.
ja_jp: コード内でこのような状況を回避するのは比較的簡単ですが、使用する依存関係をすべて検証することは困難です。通常、仮想スレッドを試している際に、Java 21-23 において link:{pgsql-driver}[postgresql-JDBC driver] の 42.6.0 より古いバージョンでは頻繁にピニングが発生することがわかりました。Java 24 以降では、synchronized の改善により、ほとんどの JDBC ドライバーはキャリアースレッドをピン留めしなくなりました。

source: It can be reasonably easy to avoid these situations in your code, but verifying every dependency you use is hard. Typically, while experimenting with virtual threads, we realized that versions older than 42.6.0 of the link:{pgsql-driver}[postgresql-JDBC driver] result in frequent pinning. Most JDBC drivers still pin the carrier thread. Even worse, many libraries require code changes.
ja_jp: コード内でこのような状況を回避するのは比較的簡単ですが、使用する依存関係をすべて検証することは困難です。 通常、仮想スレッドを試している際に、link:{pgsql-driver}[postgresql-JDBC driver] の 42.6.0 より古いバージョンでは、頻繁にピニングが発生することがわかりました。 ほとんどの JDBC ドライバーは、引き続きキャリアースレッドをピン留めします。 さらに悪いことに、多くのライブラリーではコードの変更が必要になります。

source: It can be used as a regular emitter `@Channel`:
ja_jp: これは、通常のエミッター `@Channel` として使用できます。

source: It can be used in your resource interface:
ja_jp: リソースインターフェイスで使用することができます:

source: It can be useful to test the application without having to start a Kafka broker. To achieve this, you can _switch_ the channels managed by the Kafka connector to _in-memory_.
ja_jp: Kafka ブローカーを起動しなくてもアプリケーションをテストできるのは便利です。これを行うには、Kafka コネクターで管理しているチャンネルを _インメモリー_ に _切り替え_ できます。

source: It can be useful to test the application without starting a broker. To achieve this, you can _switch_ the channels managed by a connector to _in-memory_.
ja_jp: ブローカーを起動せずにアプリケーションをテストすると便利です。 これを実現するには、コネクターで管理しているチャンネルを _in-memory_ に _切り替え_ できます。

source: It can get a token by using a programmatically created OIDC client and propagate it by passing it to a REST client method as an HTTP `Authorization` header value.
ja_jp: プログラムで作成された OIDC クライアントを使用してトークンを取得し、それを HTTP `Authorization` ヘッダー値として REST クライアントメソッドに渡すことで伝播できます。

source: It can get a token by using an OIDC client filter before propagating it.
ja_jp: トークンを伝播する前に、OIDC クライアントフィルターを使用してトークンを取得できます。

source: It can happen that a `CompletionStage` never completes or a `Uni` emits no item/failure. In this case, the rendering methods (such as `TemplateInstance#render()` and `TemplateInstance#createUni()`) fail after a specific timeout. The timeout can be specified as a template instance `timeout` attribute. If no `timeout` attribute is set the global rendering timeout is used.
ja_jp: `CompletionStage` が完了しなかったり、あるいは `Uni` がアイテム/失敗を発しないということが起こり得ます。この場合、レンダリングメソッド (`TemplateInstance#render()` および `TemplateInstance#createUni()`) は、特定のタイムアウトを過ぎると失敗します。このタイムアウトは、テンプレートインスタンスの `timeout` 属性として指定することができます。`timeout` 属性が設定されていない場合、グローバルレンダリングタイムアウトが使用されます。

source: It can happen that an expression may not be evaluated at runtime. For example, if there is an expression `{person.age}` and there is no property `age` declared on the `Person` class. The behavior differs based on whether the <<strict_rendering>> is enabled or not.
ja_jp: 式が実行時に評価されない場合があります。 たとえば、`{person.age}` という式があり、`Person` クラスに `age` というプロパティーが宣言されていない場合です。 <<strict_rendering>> が有効かどうかによって、動作が異なってきます。

source: It can occasionally be useful to see a visual representation of the interactions between the various build steps. For such cases, adding `-Djboss.builder.graph-output=build.dot` when building an application will result in the creation of the `build.dot` file in the project's root directory. See link:https://graphviz.org/resources/[this] for a list of software that can open the file and show the actual visual representation.
ja_jp: さまざまなビルドステップ間の相互作用の視覚的表現を確認すると便利な場合があります。このような場合、アプリケーションのビルド時に `-Djboss.builder.graph-output=build.dot` を追加すると、プロジェクトのルートディレクトリーに `build.dot` ファイルが作成されます。ファイルを開いて実際の視覚的表現を表示できるソフトウェアのリストについては、link:https://graphviz.org/resources/[こちら] を参照してください。

source: It can occasionally be useful to see a visual representation of the interactions between the various build steps. For such cases, adding `-Dquarkus.builder.graph-output=build.dot` when building an application will result in the creation of the `build.dot` file in the project's root directory. See link:https://graphviz.org/resources/[this] for a list of software that can open the file and show the actual visual representation.
ja_jp: さまざまなビルドステップ間のインタラクションの視覚的表現を確認すると便利な場合があります。このような場合、アプリケーションのビルド時に `-Dquarkus.builder.graph-output=build.dot` を追加すると、 プロジェクトのルートディレクトリーに `build.dot` ファイルが作成されます。ファイルを開いて実際の視覚的表現を表示できるソフトウェアのリストについては、link:https://graphviz.org/resources/[こちら] を参照してください。

source: It can often be difficult for developers to get access to a Kubernetes cluster for local development. Quarkus 3.0 includes Dev Services for Kubernetes that automatically start and configure a Kubernetes API server in dev mode and when running tests utilizing Docker. Dev Services for Kubernetes implements a service discovery mechanism for your Quarkus applications running in dev mode to share a single cluster. Learn more about <a href="https://quarkus.io/guides/kubernetes-dev-services#enabling-disabling-dev-services-for-kubernetes"> enabling Dev Services for Kubernetes</a>
ja_jp: 開発者がローカル開発のためにKubernetesクラスタにアクセスするのは、しばしば困難な場合があります。Quarkus 3.0には、Dev Services for Kubernetesが含まれており、開発モードやDockerを利用したテストの実行時に、Kubernetes APIサーバーを自動的に起動し、設定します。Dev Services for Kubernetesは、開発モードで動作するQuarkusアプリケーションが1つのクラスタを共有するためのサービスディスカバリーメカニズムを実装しています。<a href="https://ja.quarkus.io/guides/kubernetes-dev-services#enabling-disabling-dev-services-for-kubernetes"> Dev Services for Kubernetesを有効にする方法</a>について詳しくはこちらをご覧ください。

source: It can use an OIDC token propagation filter to propagate the incoming access token.
ja_jp: OIDC トークン伝播フィルターを使用して、受信したアクセストークンを伝播できます。

source: It collects service descriptors from `META-INF/services`, aggregates them, and keeps them in memory.
ja_jp: `META-INF/services` からサービスディスクリプターを収集し、それらを統合してメモリーに保持します。

source: It comes in the form of a new extension and you can find all the details in the link:/guides/security-csrf-prevention[dedicated guide].
ja_jp: これは、新しいエクステンションの形で提供され、 link:/guides/security-csrf-prevention[専用ガイド] ですべての詳細を見つけることができます。

source: It comes with some shiny new features, among them:
ja_jp: それはいくつかのピカピカの新機能が付属していますが、中でも以下のような機能があります。

source: It comes with some significant changes:
ja_jp: それはいくつかの重要な変更を含みます:

source: It contains OpenTracing interceptors that must be registered on Kafka producers and consumers.
ja_jp: KafkaのProducerとConsumerに登録しなければならないOpenTracingのインターセプターが含まれています。

source: It contains the OpenTracing CommandListener that will be registered on the configuration of the mongo client. Following the xref:mongodb.adoc[MongoDB guide], the command listener will be registered defining the config property as follows:
ja_jp: mongoクライアントのコンフィギュレーションに登録されるOpenTracing CommandListenerが含まれています。 link:mongodb[MongoDBのガイド]に従うと、コマンドリスナーは以下のようにconfigプロパティを定義して登録されます。

source: It contains the dependencies to convert the request to zipkin format. The zipkin compatibility mode will be activated after defining the config property as follows:
ja_jp: リクエストを zipkin 形式に変換するための依存関係が含まれています。以下のようにconfigプロパティを定義すると、zipkin互換モードが有効になります。

source: It creates a new HTTP server (using Vert.x) and implements our simple service when the application starts. For each HTTP request, it sends a response with "Hello from Blue!" as the body.
ja_jp: アプリケーションの起動時に、新しいHTTPサーバー（Vert.xを使用）を作成し、シンプルなサービスを実装します。各HTTPリクエストに対して、"Hello from Blue!"をボディとするレスポンスを送信します。

source: It depends ;-).
ja_jp: それは場合によりけりです ;-)。

source: It does not change how the REST client is used. Create the `src/main/java/org/acme/FrontendApi.java` file with the following content:
ja_jp: RESTクライアントの使用方法を変更するものではありません。以下の内容で `src/main/java/org/acme/FrontendApi.java` ファイルを作成します。

source: It does not enable/disable SnapStart for your function, only the Quarkus optimizations.
ja_jp: Quarkusの最適化のみで、関数のSnapStartの有効/無効は設定されません。

source: It does not include all the optimizations of `fast-jar` and is intended to be used only in conjunction with Project Leyden. So it should not be used outside of this specific use case.
ja_jp: これは `fast-jar` のすべての最適化を含んでおらず、Project Leyden と組み合わせてのみ使用することを意図しています。したがって、この特定のユースケース以外では使用すべきではありません。

source: It does not make sense to use multiple extension as part of the same build. When multiple container image extensions are present, an error will be raised to inform the user. The user can either remove the unneeded extensions or select one using `application.properties`.
ja_jp: 複数のエクステンションを同じビルドの一部として使用することは意味がありません。複数のコンテナイメージエクステンションが存在する場合は、エラーが発生してユーザーに通知されます。ユーザーは、不要なエクステンションを削除するか、 `application.properties` を使用してエクステンションを選択することができます。

source: It does not matter if you use system properties, environment variables, profiles, or an external config file. The current configuration will be used for augmentation (the content of `quarkus-app/quarkus` will be replaced with the new augmentation output). The command line above will not launch the application. Quarkus will exit immediately after the application has been re-augmented.
ja_jp: システムプロパティー、環境変数、プロファイル、外部の設定ファイルのどれを使っても構いません。現在の 設定がオーグメンテーションに使用されます (`quarkus-app/quarkus` の内容は、新しいオーグメンテーション出力に置き換えられます)。 上記のコマンドラインでは、アプリケーションは起動しません。アプリケーションが再オーグメンテーションされた後、Quarkus は直ちに終了します。

source: It doesn't handle everything (typically, Hibernate ORM API changes are not covered by the update tool) but it should handle most of the tedious work.
ja_jp: すべてを処理するわけではありませんが（通常、Hibernate ORM APIの変更はアップデートツールではカバーされません）、面倒な作業のほとんどを処理できるはずです。

source: It doesn't take care of everything but it should take care of most of the heavy-lifting.
ja_jp: すべてを引き受けるわけではありませんが、大仕事の大半を引き受けるはずです。

source: It drags a lot of dependencies - especially Lucene -, which doesn't fit well with Quarkus philosophy. The Elasticsearch team is aware of this issue and it might improve sometime in the future.
ja_jp: これは多くの依存関係(特に Lucene)を引きずっており、Quarkus の哲学にはあまり合っていません。Elasticsearch チームはこの問題を認識しており、将来的には改善されるかもしれません。

source: It drags a lot of dependencies - especially Lucene -, which doesn't fit well with Quarkus philosophy. The Elasticsearch team is aware of this issue, and it might improve sometime in the future.
ja_jp: これは多くの依存関係(特に Lucene)を引きずっており、Quarkus の哲学にはあまり合っていません。Elasticsearch チームはこの問題を認識しており、将来的には改善されるかもしれません。

source: It enables the native SSL support for your native executable. But you should not set it manually, we have a nice configuration property for this purpose as described below.
ja_jp: これらは、ネイティブ実行可能ファイルのネイティブなSSLサポートを有効にします。しかし、手動で設定するべきではありません。この目的のために、以下のような優れた設定プロパティが用意されています。

source: It executes Wasm code within the JVM's memory space, providing a "double sandbox" effect (Wasm isolation + JVM security). It also provides WASI (WebAssembly System Interface) support, that allows Wasm modules to interact with system resources safely. Finally, it includes both an _interpreter_ and a _runtime compiler_ for quick execution, in addition to a _build-time compiler_ that converts Wasm into Java bytecode for optimal performance, see https://chicory.dev/docs/usage/execution_modes/[Chicory execution modes].
ja_jp: JVM のメモリー空間内で Wasm コードを実行し、「ダブルサンドボックス」効果 (Wasm の分離 + JVM のセキュリティー) を提供します。また、Wasm モジュールがシステムリソースと安全にやり取りできるようにする WASI (WebAssembly System Interface) サポートも提供します。さらに、高速な実行のための _インタープリター_ と _ランタイムコンパイラー_ の両方に加え、Wasm を Java バイトコードに変換して最適なパフォーマンスを実現する _ビルド時コンパイラー_ も含まれています。詳細は https://chicory.dev/docs/usage/execution_modes/[Chicory execution modes] を参照してください。

source: It expects an injected `org.eclipse.microprofile.jwt.JsonWebToken` and therefore will not work with opaque tokens. Also, if your OpenID Connect provider supports a Token Exchange protocol, it is recommended to use `AccessTokenRequestFilter` instead, because both JWT and opaque bearer tokens can be securely exchanged with `AccessTokenRequestFilter`.
ja_jp: これは、注入された `org.eclipse.microprofile.jwt.JsonWebToken` を想定しているため、不透明なトークンでは動作しません。また、OpenID Connect プロバイダーが Token Exchange プロトコルをサポートしている場合は、`AccessTokenRequestFilter` で JWT と不透明なベアラートークンの両方を安全に交換できるため、代わりに `AccessTokenRequestFilter` を使用することをお勧めします。

source: It explains why the endpoint has no `@RolesAllowed` annotations - the resource access permissions are set directly in Keycloak.
ja_jp: これは、エンドポイントに `@RolesAllowed` のアノテーションがない理由を説明しています。リソースのアクセス許可は、Keycloakで直接設定されます。

source: It fixes a regression impacting OpenTelemetry and MDC data propagation introduced in 3.30.7.
ja_jp: これは、3.30.7 で導入された OpenTelemetry および MDC データ伝播に影響を与えるリグレッションを修正します。

source: It fixes some important issues in Quarkus, most notably in the Hibernate ORM extension which got Hibernate ORM upgraded to 5.4.26.Final.
ja_jp: Quarkusの幾つかの重要な課題を修正します。特に注目すべき点として、Hibernate ORMエクステンションにおいて、Hibernate ORMが5.4.26.Finalにアップグレードされます。

source: It generates a Maven project, importing the `oidc`, `rest-client-oidc-filter`, `rest-client-oidc-token-propagation`, and `rest` extensions.
ja_jp: Maven プロジェクトが生成され、 `oidc`、 `rest-client-oidc-filter`、 `rest-client-oidc-token-propagation`、および `rest` エクステンションがインポートされます。

source: It generates a new project including:
ja_jp: これは以下の内容を含む新しいプロジェクトを生成します:

source: It generates the following in `./getting-started`:
ja_jp: 以下のように `./getting-started` に生成されます。

source: It generates:
ja_jp: 以下が生成されます:

source: It gives the Quarkus and RESTEasy teams great pleasure to announce that RESTEasy Reactive integration in Quarkus has landed in the main Quarkus repo footnote:disclaimer[Currently the main RESTEasy Reactive component resides at https://github.com/quarkusio/quarkus/tree/main/independent-projects/resteasy-reactive in the main Quarkus repository; the plan is however that once things settle, this code will move to https://github.com/resteasy/resteasy-reactive. This move should not affect users of the quarkus-resteasy-reactive extensions in any way, just a heads up if anyone reads this blog post in the future and can’t find it.] and will be part of the next Quarkus release 1.11.
ja_jp: QuarkusチームとRESTEasyチームは、QuarkusでのRESTEasyReactive統合がメインのQuarkusレポジトリ footnote:disclaimer[現在、メインのRESTEasy Reactiveコンポーネントは、メインのQuarkusリポジトリのhttps://github.com/quarkusio/quarkus/tree/main/independent-projects/resteasy-reactiveにあります。 ただし、問題が解決すると、このコードはhttps://github.com/resteasy/resteasy-reactiveに移動する予定です。 この動きは、quarkus-resteasy-reactiveエクステンションのユーザーにはまったく影響を与えないはずです。将来、誰かがこのブログ投稿を読んで見つからない場合は、注意が必要です。] に取り込まれたことを発表できることを非常に嬉しく思います。 そして次のQuarkusリリース1.11の一部になります。

source: It got presented in great details by Georgios in https://quarkus.io/blog/resteasy-reactive/[the RESTEasy Reactive announcement].
ja_jp: それは link:https://quarkus.io/blog/resteasy-reactive/[RESTEasy Reactiveの発表] の中で、Georgios氏によって非常に詳細に紹介されています。

source: It has been a week since the release of `1.13.0.Final` so it is time for our traditional `.1` release.
ja_jp: `1.13.0.Final` のリリースから1週間が経ちましたので、恒例の `.1` のリリースの時間です。

source: It has been https://github.com/quarkusio/quarkus/issues/50538[reported] that some libraries using the `UnpooledByteBufAllocator` might not release some heap buffers. This will not decrement the reported allocation even if memory is no longer reserved. This might lead to astronomical values in reported memory.
ja_jp: `UnpooledByteBufAllocator` を使用する一部のライブラリーが、一部のヒープバッファーを解放しない場合があることが https://github.com/quarkusio/quarkus/issues/50538[報告されています]。これにより、メモリーがもはや予約されていない場合でも、報告された割り当ては減少しません。これは、報告されたメモリーに天文学的な値をもたらす可能性があります。

source: It has been two months since our last feature release, and we are excited to announce the availability of Quarkus 3.31!
ja_jp: 前回の機能リリースから2ヶ月が経ち、Quarkus 3.31の提供開始を発表できることを嬉しく思います！

source: It has matured a lot but we decided it was too much of a change compared to our initial promise of "you refresh, everything is fully restarted". So, in 1.13.1.Final, we disabled it by default. If your live reloads are taking too long or if you want to keep the application state as much as possible, you can enable it by adding `quarkus.live-reload.instrumentation=true` in your `application.properties`.
ja_jp: この機能は非常に成熟していますが、「リフレッシュするとすべてが完全に再起動される」という当初の約束と比べると、あまりにも変化が大きすぎると判断しました。そこで、1.13.1.Finalでは、この機能をデフォルトで無効にしました。ライブリロードに時間がかかりすぎる場合や、アプリケーションの状態をできるだけ維持したい場合には、 `application.properties` に `quarkus.live-reload.instrumentation=true` を追加することで有効にすることができます。

source: It has to start from a forward slash and be relative to the current endpoint's base URI. For example, if it is set as '/error' and the current request URI is `https://localhost:8080/callback?error=invalid_scope` then a final redirect will be made to `https://localhost:8080/error?error=invalid_scope`.
ja_jp: これはフォワードスラッシュで始まり、現在のエンドポイントのベース URI からの相対パスでなければなりません。例えば、'/error' と設定され、現在のリクエスト URI が `https://localhost:8080/callback?error=invalid_scope` であれば、最終的に `https://localhost:8080/error?error=invalid_scope` へリダイレクトされます。

source: It includes a bunch of bugfixes, together with documentation improvements.
ja_jp: 多くのバグ修正とドキュメントの改善が含まれている。

source: It includes a default `OidcClient` and named clients that can be configured like this:
ja_jp: デフォルトの `OidcClient` と、次のように設定できる名前付きクライアントが含まれています。

source: It injects and uses the REST client as usual.
ja_jp: 通常通り、RESTクライアントを注入して使用します。

source: It instructs the application to use PostgreSQL for the database and to handle the database schema generation.
ja_jp: データベースにPostgreSQLを使用し、データベーススキーマの生成を処理するようにアプリケーションに指示します。

source: It introduces a pre-initialization phase, during which selected elements are preloaded in parallel (e.g., the time zone database).
ja_jp: 事前初期化フェーズを導入し、その間に選択された要素が並行して事前ロードされます (例: タイムゾーンデータベース)。

source: It introduces specific constraints, the most common being the need to provide explicit reflection configuration. These requirements add effort during development and testing, although they are minimized for Quarkus supported extensions.
ja_jp: 特定の制約が導入され、最も一般的なのは明示的なリフレクション設定を提供する必要があることです。これらの要件は開発およびテスト中に労力を追加しますが、Quarkus がサポートするエクステンションの場合、それらは最小限に抑えられます。

source: It is a common practice to cache these results to improve performance, but the tradeoff is that there will be a delay before the changes in the LDAP get effective in your service.
ja_jp: パフォーマンスを向上させるためにこれらの結果をキャッシュするのは一般的な方法ですが、LDAPの変更がサービスで有効になるまでに遅れが生じるというトレードオフがあります。

source: It is a recommended upgrade for everyone using Quarkus 1.12.
ja_jp: これは、Quarkus 1.12を使用しているすべての人に推奨されるアップグレードです。

source: It is a safe upgrade for anyone already using 2.0.
ja_jp: これは、すでに2.0を使用している人には安全なアップグレードです。

source: It is a safe upgrade for anyone already using 2.0.0.Final.
ja_jp: すでに2.0.0.Finalをお使いの方も安心してアップグレードできます。

source: It is a safe upgrade for anyone already using 2.1.
ja_jp: これは、すでに2.1を使用している人のための安全なアップグレードです。

source: It is a safe upgrade for anyone already using 2.1.0.Final.
ja_jp: これは、すでに2.1.0.Finalをお使いの方にとって安全なアップグレードです。

source: It is a safe upgrade for anyone already using 2.2.
ja_jp: これは、すでに2.2を使用している人のための安全なアップグレードです。

source: It is a safe upgrade for anyone already using 2.3.
ja_jp: これは、すでに2.3をお使いの方にとって安全なアップグレードです。

source: It is a safe upgrade for anyone already using 2.4.
ja_jp: これは、すでに2.4を使用している人にとって安全なアップグレードです。

source: It is a safe upgrade for anyone already using 2.5.
ja_jp: これは、すでに2.5をお使いの方にとって安全なアップグレードです。

source: It is a safe upgrade for anyone already using 2.6 and contains dozens of small bugfixes, tweaks and documentation improvements.
ja_jp: これは、すでに2.6を使用している誰にとっても安全なアップグレードであり、多くの小さなバグ修正、微調整、ドキュメントの改善が含まれています。

source: It is a safe upgrade for anyone already using 2.6 and contains small bugfixes, tweaks and documentation improvements. It also brings back a working Kogito stack. Due to some infrastructure problems, the Kogito team wasn't able to deliver a Kogito version working with Quarkus 2.6 before the holiday break but that's ancient history.
ja_jp: すでに 2.6 をお使いの方にとって安全なリリースであり、小さなバグフィックスや調整、ドキュメントの改善も含まれています。また、動作するKogitoスタックも復活しました。インフラストラクチャーの問題により、Kogitoチームはホリデーブレイク前にQuarkus 2.6で動作するKogitoバージョンを提供することができませんでしたが、それは昔の話です。

source: It is a safe upgrade for anyone already using 2.6.
ja_jp: これは、すでに2.6を使用している人にとって安全なアップグレードです。

source: It is a safe upgrade for anyone already using 2.7.
ja_jp: これは、すでに2.7を使用している人にとって安全なアップグレードです。

source: It is a safe upgrade for anyone already using 2.8.
ja_jp: これは、すでに2.8をお使いの方にとって安全なアップグレードです。

source: It is a safe upgrade for anyone already using 2.9 and is highly recommended.
ja_jp: これは、すでに2.9を使用している人には安全なアップグレードです。

source: It is a safe upgrade for anyone already using 2.9.
ja_jp: これは、すでに2.9を使用している人には安全なアップグレードです。

source: It is a safe upgrade for everyone using 1.8.0.Final.
ja_jp: 1.8.0.Finalを使っている人なら誰でも安心してアップグレードできます。

source: It is a safe upgrade for everyone using Quarkus 1.10.
ja_jp: Quarkus 1.10を使用しているすべての人にとって安全なアップグレードです。

source: It is a safe upgrade for everyone using Quarkus 1.11.
ja_jp: これは、Quarkus 1.11を使用しているすべての人にとって安全なアップグレードです。

source: It is a safe upgrade for everyone using Quarkus 1.8.
ja_jp: Quarkus 1.8を使用しているすべての人にとって安全なアップグレードです。

source: It is a safe upgrade for everyone using Quarkus 1.9.
ja_jp: これは、Quarkus 1.9を使用しているすべての人にとって安全なアップグレードです。

source: It is a story about how Project Leyden gave us a new perspective on how we think about startup performance in Quarkus, and, more broadly, in Java.
ja_jp: これは、Project Leyden が Quarkus、そしてより広くは Java 全体における起動パフォーマンスの考え方に、いかに新しい視点を与えてくれたかという物語です。

source: It is a story with flamegraphs.
ja_jp: これは、フレームグラフが登場する物語でもあります。

source: It is a straightforward test, but at least it will detect if our application is pinning. Run the test with either:
ja_jp: これは単純なテストですが、少なくともアプリケーションがピン止めされているかどうかを検出します。どちらかを使ってテストを実行してください：

source: It is a typical flow for many OIDC `web-app` applications. Once the user lands on the initial secured page, your application can return an HTML page which uses links to guide users to other parts of the application or users can be immediately redirected to other application resources with the help of JAX-RS API.
ja_jp: これは、多くの OIDC `web-app` アプリケーションに共通するフローです。ユーザーが最初のセキュリティー保護されたページにアクセスすると、アプリケーションは、ユーザーをアプリケーションの他の部分に誘導するリンクを使用する HTML ページを返すか、JAX-RS API を利用してユーザーを他のアプリケーションリソースにすぐにリダイレクトできます。

source: It is advised to use the Syslog handler instead.
ja_jp: 代わりに Syslog ハンドラーを使用することを推奨します。

source: It is advised to use xref:opentelemetry-logging.adoc[OpenTelemetry Logging] or the Socket handler instead.
ja_jp: 代わりに xref:opentelemetry-logging.adoc[OpenTelemetry Logging] またはソケットハンドラーを使用することを推奨します。

source: It is all about the community
ja_jp: すべてはコミュニティのために

source: It is all that you need to do to start using the Redis `TokenStateManager`.
ja_jp: Redis `TokenStateManager` の使用を開始するために必要なのはこれだけです。

source: It is also possible to add a prefix when you are generating env from ConfigMap, the following configuration creates environment variable from ConfigMap with key `foo` adding a prefix `BAR`:
ja_jp: ConfigMap から env を生成するときに接頭辞を追加することもできます。次の設定では、キー `foo` に接頭辞 `BAR` を追加して、ConfigMap から環境変数を作成します。

source: It is also possible to add a prefix when you are generating env from Secret, the following configuration creates environment variable from Secret with key `foo` adding a prefix `BAR`:
ja_jp: Secret から env を生成するときに接頭辞を追加することもできます。次の設定では、接頭辞 `BAR` を追加したキー `foo` を使用して Secret から環境変数を作成します。
